<?php

namespace App\Console\Commands\Wb;

use Illuminate\Console\Command;
use App\Services\Management\ClusterManager;

class SetClusters extends Command
{
    protected $signature = 'wb:set-clusters';
    protected $description = 'Synchronize clusters';

    protected $clusterManager;

    public function __construct(ClusterManager $clusterManager)
    {
        parent::__construct();
        $this->clusterManager = $clusterManager;
    }

    public function handle()
    {
        $this->info("Syncing clusters...");

        $data = [
            'Краснодар' => [
                'warehouses' => ['Невинномысск', 'Краснодар'],
                'regions' => [
                    'Арагацотнская область', 'Араратская область', 'Армавирская область', 
                    'Астраханская область', 'Вайоцдзорская область', 'Волгоградская область', 
                    'Гехаркуникская область', 'Ереван', 'Кабарино-Балкарская Республика', 
                    'Карачаево-Черкесская Республика', 'Котайкская область', 'Краснодарский край', 
                    'Лорийская область', 'Республика Адыгея', 'Республика Дагестан', 
                    'Республика Ингушетия', 'Республика Калмыкия', 'Республика Крым', 
                    'Республика Северная Осетия — Алания', 'Ростовская область', 'Севастополь', 
                    'Ставропольский край', 'Сюникская область', 'Тавушская область', 
                    'Ширакская область', 'федеральная территория Сириус', 'Чеченская Республика',
                ],
            ],
            'Казань' => [
                'warehouses' => ['Алатани', 'Новосемейкино', 'СЦ Ижевск', 'Волгоград'],
                'regions' => [
                    'Республика Коми', 'Республика Марий Эл', 'Республика Мордовия', 
                    'Республика Татарстан', 'Республика Удмуртия', 'Самарская область', 
                    'Сахалинская область', 'Ульяновская область', 'Чувашская Республика',
                ],
            ],
            'Коледино' => [
                'warehouses' => ['Коледино', 'Подольск', 'Тула', 'Белые Столбы', 'Рязань (Тюшевое)', 'Минск'],
                'regions' => [
                    'Белгородская область', 'Брестская область', 'Брянская область', 'Витебская область', 
                    'Воронежская область', 'Гомельская область', 'Гродненская область', 'Калининградская область', 
                    'Калужская область', 'Курская область', 'Липецкая область', 'Минск', 'Минская область', 
                    'Могилёвская область', 'Москва', 'Московская область', 'Мурманская область', 
                    'Орловская область', 'Рязанская область', 'Смоленская область', 'Тамбовская область', 
                    'Тульская область',
                ],
            ],
            'Екатеринбург - Перспективная 12' => [
                'warehouses' => ['Новосибирск', 'Екатеринбург - Перспективная 12', 'Астана', 'Хабаровск', 'Екатеринбург - Испытателей 14', 'СЦ Барнаул'],
                'regions' => [
                    'Джалал-Абадская область', 'Наманганская область', 'Таласская область', 'Ферганская область',
                ],
            ],
            'Электросталь' => [
                'warehouses' => ['Электросталь', 'Санкт-Петербург Уткина Заводь', 'Вешки'],
                'regions' => [
                    'Архангельская область', 'Владимирская область', 'Вологодская область', 'Ивановская область', 
                    'Костромская область', 'Ленинградская область', 'Мурманская область', 'Новгородская область', 
                    'Псковская область', 'Республика Карелия', 'Тверская область', 'Ярославская область',
                ],
            ],
        ];

        $this->clusterManager->createClusters($data);

        $this->info('Clusters synchronized successfully.');
    }
}
